In [1]:
# Reference: 
# online free docs:          https://pandas.pydata.org/pandas-docs/stable/
# book old edition free:  https://www.safaribooksonline.com/library/view/python-data-science/9781491912126/
# book new edition pay: https://smile.amazon.com/Python-Data-Science-Handbook-Essential/dp/1491912057/

In [3]:
import numpy as np
import pandas as pd

In [4]:
##### Conditional Selection using Masking #####

In [5]:
np.random.seed(0)
df = pd.DataFrame(np.random.randint(-100, 100, (4,5)), index=['W','X','Y','Z'], columns = ['A','B','C','D','E'])
df

    A   B   C   D   E
W  72 -53  17  92 -33
X  95   3 -91 -79 -64
Y -13 -30 -12  40 -42
Z  93 -61 -13  74 -12

In [6]:
# conditional selection on entire dataframe
df > 0

       A      B      C      D      E
W   True  False   True   True  False
X   True   True  False  False  False
Y  False  False  False   True  False
Z   True  False  False   True  False

In [7]:
df[df>0]

      A    B     C     D   E
W  72.0  NaN  17.0  92.0 NaN
X  95.0  3.0   NaN   NaN NaN
Y   NaN  NaN   NaN  40.0 NaN
Z  93.0  NaN   NaN  74.0 NaN

In [8]:
# conditional selection on a column
df['D'] > 0

W     True
X    False
Y     True
Z     True
Name: D, dtype: bool

In [9]:
df[df['D']>0]

    A   B   C   D   E
W  72 -53  17  92 -33
Y -13 -30 -12  40 -42
Z  93 -61 -13  74 -12

In [10]:
df[df['D']>0]['B']

W   -53
Y   -30
Z   -61
Name: B, dtype: int32

In [11]:
# multiple conditions
#    - notice we don't use "and"/"or" here since the result of each operation is not True/False but a series of True/False 
#    - so we have to use "&" and "|"" instead
(df['D'] > 0) & (df['D']%4 == 0)

W     True
X    False
Y     True
Z    False
Name: D, dtype: bool

In [12]:
df[(df['D'] > 0) & (df['D']%4 == 0)]

    A   B   C   D   E
W  72 -53  17  92 -33
Y -13 -30 -12  40 -42

In [13]:
df[(df['D'] > 0) & (df['D']%4 == 0)][['C','D']]

    C   D
W  17  92
Y -12  40